#+TITLE: Linux Note
#+hugo_base_dir: /home/awannaphasch2016/org/projects/sideprojects/website/my-website/hugo/quickstart
#+filetags: linux

*** whereis vs which
=whereis= searches for "possibly useful" files, while =which= only searches for executables.

run =whatis= result on the two command, we get the following
#+BEGIN_SRC sh
whatis which
#+END_SRC

#+RESULTS:
: which (1)            - locate a command

#+BEGIN_SRC sh
whatis whereis
#+END_SRC

#+RESULTS:
| whereis (1)          - locate the binary | source | and manual page files for a command |

*** whatis
provide tldr description of target command.
#+BEGIN_SRC sh
whatis which
#+END_SRC

#+RESULTS:
|                                         |
| which (1)            - locate a command |
